tap "achannarasappa/tap"
tap "anomalyco/tap"
tap "antoniorodr/memo"
tap "deskflow/tap"
tap "hudochenkov/sshpass"
tap "lizardbyte/homebrew"
tap "microsoft/mssql-release"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "steipete/tap"
# Simple, modern, secure file encryption
brew "age"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Object-file caching compiler wrapper
brew "ccache"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Hacker News in your terminal
brew "circumflex"
# Cross-platform make
brew "cmake"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Program that can automate interactive applications
brew "expect"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Fast and simple Node.js version manager
brew "fnm"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Conversion library
brew "libiconv"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Compute various size metrics for a Git repository
brew "git-sizer"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Ping, but with a graph
brew "gping"
# Post-modern modal text editor
brew "helix"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Generic library support script
brew "libtool"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Command-line Git information tool
brew "onefetch"
# Apache Parquet command-line tools and utilities
brew "parquet-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Modern replacement for ps written in Rust
brew "procs"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Find and verify credentials
brew "trufflehog"
# Extremely fast Python type checker, written in Rust
brew "ty"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terminal stock ticker with live updates and position tracking
brew "achannarasappa/tap/ticker"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
brew "hudochenkov/sshpass/sshpass"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
# Grep the GIF. Stick the landing
brew "steipete/tap/gifgrep"
# Multi-provider order CLI (Foodora, Deliveroo)
brew "steipete/tap/ordercli"
# Command-line ElevenLabs TTS with mac-style flags
brew "steipete/tap/sag"
# Chromium based browser
cask "arc"
# Online gaming platform
cask "battle-net"
# Display management tool
cask "betterdisplay"
# Virtual Audio Driver
cask "blackhole-16ch"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Two-panel file manager
cask "commander-one"
# Mouse and keyboard sharing utility
cask "deskflow/tap/deskflow"
# Online diagram software
cask "drawio"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# VPN client for secure and private internet access
cask "expressvpn"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Game launcher
cask "heroic"
# HTTP and GraphQL Client
cask "insomnia"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logi-options+"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Multi-platform web browser
cask "microsoft-edge"
# TeX distribution
cask "miktex-console"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source software for live streaming and screen recording
cask "obs"
# Get up and running with large language models locally
cask "ollama-app"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Customizable email client
cask "thunderbird"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Alto's Adventure The Spirit of the Mountain", id: 1576663233
mas "Apple Configurator", id: 1037126344
mas "Authenticator", id: 6472872177
mas "Authenticator", id: 1538761576
mas "Bitwarden", id: 1352778147
mas "Brother P-touch Editor", id: 1453365242
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "Goodnotes", id: 1444383602
mas "GRID™ Legends", id: 1636273501
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "LIMBO+", id: 1618201675
mas "NeoServer", id: 6448362669
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Raycast Companion", id: 6738274497
mas "Say No to Notch", id: 1639306886
mas "SecurID Authenticator", id: 318038618
mas "Speedtest", id: 1153157709
mas "The Lost City", id: 1538650027
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "atlassian.atlascode"
vscode "charliermarsh.ruff"
vscode "codium.codium"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "financialforce.lana"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "heyprincesingh.pycache-cleaner"
vscode "loginspector.loginspector"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "nicollasr.vscode-streamdeck"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "prasadgk.pythoncodelens"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
